package impruveEnglish.ps.negative;

public class StringRusNegPS
{
    private String[] strNegRu = new String[73];

    public String[] getStrNegRu() {
        negStrRu();
        return strNegRu;
    }

    private void negStrRu() {
        strNegRu[1] ="Я не знаю";
        strNegRu[2] ="Мы не понимаем";
        strNegRu[3] ="Ты не пытаешься выучить Английский";
        strNegRu[4] ="Они не помогают мне";
        strNegRu[5] ="Я согласен с тобой";
        strNegRu[6] ="Я не согласен с тобой";
        strNegRu[7] ="Мне не нравится это";
        strNegRu[8] ="Я не хочу учиться там";
        strNegRu[9] ="Я хочу обсудить это";
        strNegRu[10] ="Я не хочу обсуждать это";
        strNegRu[11] ="Я не хочу делать это прямо сейчас";
        strNegRu[12] ="Я не хочу делать это позже";
        strNegRu[13] ="Я не хочу говорить это";
        strNegRu[14] ="Я не хочу говорить тебе эту вещь";
        strNegRu[15] ="Я не хочу говорить тебе об этой проблеме";
        strNegRu[16] ="Я не хочу думать об этом";
        strNegRu[17] ="Он не знает это";
        strNegRu[18] ="Она не хочет обсуждать это";
        strNegRu[19] ="Это не помогает мне";
        strNegRu[20] ="Это не кажется странным";
        strNegRu[21] ="Это не работает";
        strNegRu[22] ="Я не хочу это знать";
        strNegRu[23] ="Он не работает там";
        strNegRu[24] ="Он не работает здесь";
        strNegRu[25] ="Она не помнит это";
        strNegRu[26] ="Он не хочет читать эти книги";
        strNegRu[27] ="Он хочет читать те книги";
        strNegRu[28] ="У него нет этой информации";
        strNegRu[29] ="Он не хочет играть в компьютерные игры";
        strNegRu[30] ="Он не знает этого человека";
        strNegRu[31] ="Он не хочет пытаться найти хорошую работу";
        strNegRu[32] ="Он не пытается найти хорошую работу";
        strNegRu[33] ="Я не хочу жить в этой стране";
        strNegRu[34] ="Мой друг не думает так";
        strNegRu[35] ="Мы не хотим жить в другом месте";
        strNegRu[36] ="Это не кажется полезным";
        strNegRu[37] ="Я не хочу думать об этом";
        strNegRu[38] ="Я не понимаю этих людей";
        strNegRu[39] ="У него нет машины";
        strNegRu[40] ="Я не хочу пить";
        strNegRu[41] ="Я не хочу жить в этом городе";
        strNegRu[42] ="Эта вещь не интересует меня";
        strNegRu[43] ="Эти вещи не привлекают меня";
        strNegRu[44] ="Та вещь не кажется интересной";
        strNegRu[45] ="Те вещи не кажутся странными";
        strNegRu[46] ="Те уроки не кажутся полезными";
        strNegRu[47] ="Эти уроки кажутся очень полезными";
        strNegRu[48] ="Тот метод не помогает";
        strNegRu[49] ="Этот метод реально помогает";
        strNegRu[50] ="Мой брат не хочет думать о своем будущем";
        strNegRu[51] ="Моя сестра не знает этого человека";
        strNegRu[52] ="Мои друзья не рекомендуют этот отель";
        strNegRu[53] ="Его сын не хочет стать доктором";
        strNegRu[54] ="Её дочь не хочет учиться там";
        strNegRu[55] ="Его родители не чувствуют себя счастливыми";
        strNegRu[56] ="Этот человек не пытается изменить свою жизнь";
        strNegRu[57] ="Мой босс не видит её";
        strNegRu[58] ="Мой партнер не знает его";
        strNegRu[59] ="Мы с моим другом не звоним им";
        strNegRu[60] ="Наш учитель не верит нам";
        strNegRu[61] ="Он думает деньги не приносят людям счастья";
        strNegRu[62] ="Она думает деньги не делают людей счастливыми";
        strNegRu[63] ="Я хочу сделать вас счастливыми";
        strNegRu[64] ="Я не заказываю еду там";
        strNegRu[65] ="У нас нет каких-либо вопросов";
        strNegRu[66] ="Ты не понимаешь нас";
        strNegRu[67] ="Они не верят ему";
        strNegRu[68] ="Она не говорит мне эти вещи";
        strNegRu[69] ="Он не говорит по-испански";
        strNegRu[70] ="Это не мотивирует меня";
        strNegRu[71] ="Наши учителя не объясняют это";
        strNegRu[72] ="Её парень не знает об этой проблеме";
    }
}
